---
kind: enumMember
id: F:Autodesk.Revit.DB.HorizontalTextAlignment.Right
enum: Autodesk.Revit.DB.HorizontalTextAlignment
source: html/f904dd9f-28ce-00fe-352f-03fd869e4199.htm
---
# Autodesk.Revit.DB.HorizontalTextAlignment.Right

Text is Right justified inside the containing text box, and the right side of the text box remains in place as the width changes.